---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeDiameterDimensionTypeId
source: html/e1726e14-2a8f-0bcd-1d2e-2d99f3790aef.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeDiameterDimensionTypeId Property

"Diameter Dimension Style"

## Syntax (C#)
```csharp
public static ForgeTypeId BendingDetailTypeDiameterDimensionTypeId { get; }
```